; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	thermograph2 - mode
	image0 - mode
	infrared1 - mode
	GroundStation2 - direction
	Star6 - direction
	GroundStation9 - direction
	Star11 - direction
	Star5 - direction
	GroundStation29 - direction
	Star13 - direction
	GroundStation18 - direction
	Star4 - direction
	Star21 - direction
	GroundStation24 - direction
	GroundStation10 - direction
	Star22 - direction
	Star15 - direction
	GroundStation28 - direction
	Star0 - direction
	Star20 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation25 - direction
	Star8 - direction
	GroundStation16 - direction
	Star1 - direction
	Star14 - direction
	Star19 - direction
	Star17 - direction
	Star27 - direction
	GroundStation23 - direction
	Star12 - direction
	Star26 - direction
	Phenomenon30 - direction
	Planet31 - direction
	Planet32 - direction
	Planet33 - direction
	Phenomenon34 - direction
	Star35 - direction
	Star36 - direction
	Planet37 - direction
	Planet38 - direction
	Phenomenon39 - direction
	Star40 - direction
	Star41 - direction
	Planet42 - direction
	Phenomenon43 - direction
	Star44 - direction
	Star45 - direction
	Planet46 - direction
	Phenomenon47 - direction
	Star48 - direction
	Star49 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star27)
	(calibration_target instrument0 GroundStation29)
	(calibration_target instrument0 Star26)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation18)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star15)
	(calibration_target instrument0 Star22)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star21)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation18)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation29)
	(supports instrument2 infrared3)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation24)
	(calibration_target instrument2 Star14)
	(supports instrument3 infrared1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation25)
	(calibration_target instrument3 GroundStation10)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star20)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation28)
	(calibration_target instrument4 GroundStation23)
	(calibration_target instrument4 Star15)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation16)
	(calibration_target instrument4 Star22)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet37)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation16)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation25)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star26)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star26)
	(calibration_target instrument6 Star12)
	(calibration_target instrument6 GroundStation23)
	(calibration_target instrument6 Star27)
	(calibration_target instrument6 Star17)
	(calibration_target instrument6 Star19)
	(calibration_target instrument6 Star14)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation28)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite2 Star26)
	(have_image Phenomenon30 image0)
	(have_image Planet31 image0)
	(have_image Planet32 infrared1)
	(have_image Planet33 infrared3)
	(have_image Phenomenon34 infrared3)
	(have_image Star35 image0)
	(have_image Star36 infrared1)
	(have_image Planet37 thermograph2)
	(have_image Planet38 thermograph2)
	(have_image Phenomenon39 image0)
	(have_image Star40 thermograph2)
	(have_image Star41 infrared1)
	(have_image Planet42 infrared3)
	(have_image Phenomenon43 image0)
	(have_image Star44 infrared1)
	(have_image Star45 thermograph2)
	(have_image Planet46 infrared3)
	(have_image Phenomenon47 thermograph2)
	(have_image Star48 thermograph2)
	(have_image Star49 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation18 groundstation29)
   deleted: (pointing satellite0 groundstation29)
   added: (pointing satellite0 groundstation18)
   goals met: 0 of 22
2. (turn_to satellite2 star26 groundstation28)
   deleted: (pointing satellite2 groundstation28)
   added: (pointing satellite2 star26)
   goals met: 1 of 22
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 22
4. (calibrate satellite2 instrument5 star26)
   added: (calibrated instrument5)
   goals met: 1 of 22
5. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 22
6. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 22
7. (calibrate satellite0 instrument1 groundstation18)
   added: (calibrated instrument1)
   goals met: 1 of 22
8. (turn_to satellite1 phenomenon30 planet37)
   deleted: (pointing satellite1 planet37)
   added: (pointing satellite1 phenomenon30)
   goals met: 1 of 22
9. (turn_to satellite0 phenomenon34 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon34)
   goals met: 1 of 22
10. (take_image satellite0 phenomenon34 instrument1 infrared3)
   added: (have_image phenomenon34 infrared3)
   goals met: 2 of 22
11. (turn_to satellite0 phenomenon47 phenomenon34)
   deleted: (pointing satellite0 phenomenon34)
   added: (pointing satellite0 phenomenon47)
   goals met: 2 of 22
12. (take_image satellite0 phenomenon47 instrument1 thermograph2)
   added: (have_image phenomenon47 thermograph2)
   goals met: 3 of 22
13. (turn_to satellite0 planet33 phenomenon47)
   deleted: (pointing satellite0 phenomenon47)
   added: (pointing satellite0 planet33)
   goals met: 3 of 22
14. (take_image satellite0 planet33 instrument1 infrared3)
   added: (have_image planet33 infrared3)
   goals met: 4 of 22
15. (turn_to satellite0 planet37 planet33)
   deleted: (pointing satellite0 planet33)
   added: (pointing satellite0 planet37)
   goals met: 4 of 22
16. (take_image satellite0 planet37 instrument1 thermograph2)
   added: (have_image planet37 thermograph2)
   goals met: 5 of 22
17. (turn_to satellite0 planet38 planet37)
   deleted: (pointing satellite0 planet37)
   added: (pointing satellite0 planet38)
   goals met: 5 of 22
18. (take_image satellite0 planet38 instrument1 thermograph2)
   added: (have_image planet38 thermograph2)
   goals met: 6 of 22
19. (turn_to satellite0 planet42 planet38)
   deleted: (pointing satellite0 planet38)
   added: (pointing satellite0 planet42)
   goals met: 6 of 22
20. (take_image satellite0 planet42 instrument1 infrared3)
   added: (have_image planet42 infrared3)
   goals met: 7 of 22
21. (turn_to satellite0 planet46 planet42)
   deleted: (pointing satellite0 planet42)
   added: (pointing satellite0 planet46)
   goals met: 7 of 22
22. (take_image satellite0 planet46 instrument1 infrared3)
   added: (have_image planet46 infrared3)
   goals met: 8 of 22
23. (turn_to satellite0 star40 planet46)
   deleted: (pointing satellite0 planet46)
   added: (pointing satellite0 star40)
   goals met: 8 of 22
24. (take_image satellite0 star40 instrument1 thermograph2)
   added: (have_image star40 thermograph2)
   goals met: 9 of 22
25. (turn_to satellite0 star45 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 star45)
   goals met: 9 of 22
26. (take_image satellite0 star45 instrument1 thermograph2)
   added: (have_image star45 thermograph2)
   goals met: 10 of 22
27. (turn_to satellite0 star48 star45)
   deleted: (pointing satellite0 star45)
   added: (pointing satellite0 star48)
   goals met: 10 of 22
28. (take_image satellite0 star48 instrument1 thermograph2)
   added: (have_image star48 thermograph2)
   goals met: 11 of 22
29. (turn_to satellite0 star49 star48)
   deleted: (pointing satellite0 star48)
   added: (pointing satellite0 star49)
   goals met: 11 of 22
30. (take_image satellite0 star49 instrument1 infrared3)
   added: (have_image star49 infrared3)
   goals met: 12 of 22
31. (turn_to satellite0 star8 star49)
   deleted: (pointing satellite0 star49)
   added: (pointing satellite0 star8)
   goals met: 13 of 22
32. (turn_to satellite2 planet32 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 planet32)
   goals met: 12 of 22
33. (take_image satellite2 planet32 instrument5 infrared1)
   added: (have_image planet32 infrared1)
   goals met: 13 of 22
34. (turn_to satellite2 star26 planet32)
   deleted: (pointing satellite2 planet32)
   added: (pointing satellite2 star26)
   goals met: 14 of 22
35. (turn_to satellite2 star36 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 star36)
   goals met: 13 of 22
36. (take_image satellite2 star36 instrument5 infrared1)
   added: (have_image star36 infrared1)
   goals met: 14 of 22
37. (turn_to satellite2 star26 star36)
   deleted: (pointing satellite2 star36)
   added: (pointing satellite2 star26)
   goals met: 15 of 22
38. (turn_to satellite2 star41 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 star41)
   goals met: 14 of 22
39. (take_image satellite2 star41 instrument5 infrared1)
   added: (have_image star41 infrared1)
   goals met: 15 of 22
40. (turn_to satellite2 star26 star41)
   deleted: (pointing satellite2 star41)
   added: (pointing satellite2 star26)
   goals met: 16 of 22
41. (turn_to satellite2 star44 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 star44)
   goals met: 15 of 22
42. (take_image satellite2 star44 instrument5 infrared1)
   added: (have_image star44 infrared1)
   goals met: 16 of 22
43. (turn_to satellite2 star26 star44)
   deleted: (pointing satellite2 star44)
   added: (pointing satellite2 star26)
   goals met: 17 of 22
44. (turn_to satellite1 star14 phenomenon30)
   deleted: (pointing satellite1 phenomenon30)
   added: (pointing satellite1 star14)
   goals met: 17 of 22
45. (calibrate satellite1 instrument2 star14)
   added: (calibrated instrument2)
   goals met: 17 of 22
46. (turn_to satellite1 phenomenon30 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 phenomenon30)
   goals met: 17 of 22
47. (take_image satellite1 phenomenon30 instrument2 image0)
   added: (have_image phenomenon30 image0)
   goals met: 18 of 22
48. (turn_to satellite1 phenomenon39 phenomenon30)
   deleted: (pointing satellite1 phenomenon30)
   added: (pointing satellite1 phenomenon39)
   goals met: 18 of 22
49. (take_image satellite1 phenomenon39 instrument2 image0)
   added: (have_image phenomenon39 image0)
   goals met: 19 of 22
50. (turn_to satellite1 phenomenon43 phenomenon39)
   deleted: (pointing satellite1 phenomenon39)
   added: (pointing satellite1 phenomenon43)
   goals met: 19 of 22
51. (take_image satellite1 phenomenon43 instrument2 image0)
   added: (have_image phenomenon43 image0)
   goals met: 20 of 22
52. (turn_to satellite1 planet31 phenomenon43)
   deleted: (pointing satellite1 phenomenon43)
   added: (pointing satellite1 planet31)
   goals met: 20 of 22
53. (take_image satellite1 planet31 instrument2 image0)
   added: (have_image planet31 image0)
   goals met: 21 of 22
54. (turn_to satellite1 star35 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 star35)
   goals met: 21 of 22
55. (take_image satellite1 star35 instrument2 image0)
   added: (have_image star35 image0)
   goals met: 22 of 22
